# -*- coding: utf-8 -*-
"""
Created on Tue Jul 25 21:25:52 2017

@author: Administrator
"""
import xlwt  
import pandas as pd
import tushare as ts
import numpy as np
import math
import scipy.stats as scs
import statsmodels.api as sm  
import matplotlib as mpl  
import matplotlib.pyplot as plt 
def df(s,d,b):
    pan=ts.get_k_data(s,d,b)
    pans=pan['close']
    returns=pans/pans.shift(1)-1
    return returns
#a=df('601857','2017-01-02','2017-07-17')
#b=df('600019','2017-01-02','2017-07-17')

lista=['601857','601088','601898','601225','600276',
'002252','600028','600688','600309','002450',
'600011','600900','601985','600019','600010',
'000898','000959','600018','601111','601006',
'601899','601600','600547','603993','000002',
'600606','600048','600585','000012','002271','000725',
'600703','002415','601668','601390','601800',
'601186','000938','600100','600271','601727',
'600482','600406','002202','600637','002558',
'002027','601766','600031','000039','000157',
'600050','000063',#'600485',
'601989','000768','601398','601288','601939','600036','600000',
'600104','002594','601238','601633','601318',
'601628','601601','000333','600690','601992',
'000839','600704','600398','601718','600177',
'600612','000488','002572','002024','601933',
'600415','000876','300498','002385','600519',
'600887','000858','601888','300144','600754','sh','zxb','cyb']
listname=['中国石油','中国神华','中煤能源','陕西煤业',
'恒瑞医药','上海莱士','中国石化','上海石化',
'万华化学','康得新','华能国际','长江电力',
'中国核电','宝钢股份','包钢股份','鞍钢股份',
'首钢股份','上港集团','中国国航','大秦铁路',
'紫金矿业','中国铝业','山东黄金',
'洛阳钼业','万科A','绿地控股','保利地产',
'海螺水泥','南玻A','东方雨虹','京东方A','三安光电','海康威视',
'中国建筑','中国中铁','中国交建','中国铁建',
'紫光股份','同方股份','航天信息','上海电气',
'中国动力','国电南瑞','金风科技','东方明珠',
'巨人网络','分众传媒','中国中车','三一重工',
'中集集团','中联重科','中国联通','中兴通讯',#'信威集团',
'中国重工','中航飞机','工商银行',
'农业银行','建设银行','招商银行','浦发银行',
'上汽集团','比亚迪','广汽集团','长城汽车',
'中国平安','中国人寿','中国太保','美的集团',
'青岛海尔','金隅股份','中信国安','物产中大',
'海澜之家','际华集团','雅戈尔','老凤祥','晨鸣纸业',
'索菲亚','苏宁云商','永辉超市','小商品城','新希望','温氏股份',
'大北农','贵州茅台','伊利股份','五粮液','中国国旅',
'宋城演艺','锦江股份','上证','中小板','创业板']
start='2017-01-04'
end='2017-07-25'
period_2016='2016-01-03'
period1_2016='2016-12-31'
period_2015='2014-02-03'
period1_2015='2015-06-31'
sd=pd.DataFrame()
#sd_2016=pd.DataFrame()
#sd_2016=pd.DataFrame()
for a in lista:
    sd[a]=df(a,start,end)
    #sd_2016[a]=df(a,period_2016,period1_2016)
    #sd_2015[a]=df(a,period_2015,period1_2015)
#相关系数
cor=sd.corr()
#cor_2016=sd_2016.corr()
#cor_2015=sd_2015.corr()
cor.index=listname
cor.columns=listname
#cor_2016.columns=listname
#cor_2016.index=listname
#cor_2015.index=listname
#cor_2015.columns=listname
cor.to_csv('C:/Users/Administrator/Desktop/to.csv')
#cor.to_csv('C:/Users/Administrator/Desktop/实习/coeffient2.csv')
#cor.to_csv('C:/Users/Administrator/Desktop/实习/coeffient3.csv')
print cor
